//я научился удалять репозитории
//научился создавать юзера в гит
//git config user.name - юзер
//git config user.email - мыло юзера
//научился удалять юзеров:
//git config --unset
//git config --remove -section user
//я выучил команды git config --list
//Настройки для разных уровней приватности как я понял:
//--local - локальные, -global - глобальные, --system - на уровне системы
//Научился смотреть файлы репо через гит:
//ls
//Научился смотреть состояние файлов в гите:
//git status
//Научился добавлять файлы в индексирование гита:
//git add main.cpp
//а так же переносить файлы из индекса в репозиторий
//git commit